{
    "experiment name": "Dijkstra's Algorithm",
    "problems": [
        {
            "problem name": "City Navigation System",
            "description": "Implement Dijkstra's algorithm to find the shortest paths in a city map. The roads are represented as unweighted edges, and the goal is to find the shortest distance from the starting location to all other locations.",
            "inputs": [
                ["Home", "School", "Park", "Mall", "Library"],
                [
                    ["Home", "School", 4],
                    ["Home", "Park", 2],
                    ["School", "Park", 1],
                    ["School", "Mall", 5],
                    ["Park", "Mall", 3],
                    ["Park", "Library", 6],
                    ["Mall", "Library", 2]
                ],
                "Home"
            ],
            "expected": [
                ["Home", 0],
                ["Park", 2],
                ["School", 3],
                ["Mall", 5],
                ["Library", 7]
            ],
            "inputs description": "Input consists of a city map represented by locations - inp1 and roads with travel distances - inp2, along with the starting location - inp3. The edges are unweighted.",
            "expected description": "An array where each element is a sub-array containing a location and its shortest travel distance from the starting location, e.g. [location, min_distance]. The vertices should be ordered from the closest distance to the furthest distance from the starting location.",
            "difficulty": "beginner"
        },
        {
            "problem name": "Signal Transmission Time",
            "description": "In a network of n devices, labeled from 1 to n, you are given travel times as directed edges times[i] = (source, target, time), where source is the device sending the signal, target is the receiving device, and time is the time it takes for the signal to travel. A signal is sent from a given device k. Determine the minimum time required for all n devices to receive the signal. If it's impossible for all devices to receive the signal, return -1.",
            "inputs": [
                [["A", "B", 1], ["A", "C", 4], ["B", "C", 2], ["B", "D", 7], ["C", "D", 3], ["D", "E", 1]], 
                5, 
                1
            ],
            "expected": 7,
            "inputs description": "Input consists of directed edges represented by an array of [source, target, time] - inp1, the number of devices - inp2, and the source device - inp3.",
            "expected description": "An integer representing the minimum time for all devices to receive the signal, or -1 if it's impossible.",
            "difficulty": "intermediate"
        }
    ]
}